src/main/resources/autotest/testreport/sysbench_point_select_20190506073339.log
sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 8464.73 qps: 8464.73 (r/w/o: 8464.73/0.00/0.00) lat (ms,95%): 4.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 8734.49 qps: 8734.49 (r/w/o: 8734.49/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 8805.08 qps: 8805.08 (r/w/o: 8805.08/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 8432.67 qps: 8432.67 (r/w/o: 8432.67/0.00/0.00) lat (ms,95%): 4.18 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 8901.70 qps: 8901.70 (r/w/o: 8901.70/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 8931.91 qps: 8931.91 (r/w/o: 8931.91/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 8928.32 qps: 8928.32 (r/w/o: 8928.32/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 9010.96 qps: 9010.96 (r/w/o: 9010.96/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 8944.73 qps: 8944.73 (r/w/o: 8944.73/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 8902.20 qps: 8902.20 (r/w/o: 8902.20/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 8978.95 qps: 8978.95 (r/w/o: 8978.95/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 8675.47 qps: 8675.47 (r/w/o: 8675.47/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 6967.36 qps: 6967.36 (r/w/o: 6967.36/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 7149.43 qps: 7149.43 (r/w/o: 7149.43/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 7354.79 qps: 7354.79 (r/w/o: 7354.79/0.00/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 8353.04 qps: 8353.04 (r/w/o: 8353.04/0.00/0.00) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 8373.55 qps: 8373.55 (r/w/o: 8373.55/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 8144.83 qps: 8144.83 (r/w/o: 8144.83/0.00/0.00) lat (ms,95%): 4.18 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 8717.20 qps: 8717.20 (r/w/o: 8717.20/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 8781.52 qps: 8781.52 (r/w/o: 8781.52/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 8888.37 qps: 8888.37 (r/w/o: 8888.37/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 8837.52 qps: 8837.52 (r/w/o: 8837.52/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 8020.19 qps: 8020.19 (r/w/o: 8020.19/0.00/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 8726.98 qps: 8726.98 (r/w/o: 8726.98/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 8736.66 qps: 8736.66 (r/w/o: 8736.66/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 8559.66 qps: 8559.66 (r/w/o: 8559.66/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 8938.11 qps: 8938.11 (r/w/o: 8938.11/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 8427.52 qps: 8427.52 (r/w/o: 8427.52/0.00/0.00) lat (ms,95%): 4.25 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 8363.79 qps: 8363.79 (r/w/o: 8363.79/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 8787.51 qps: 8787.51 (r/w/o: 8787.51/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2558514
        write:                           0
        other:                           0
        total:                           2558514
    transactions:                        2558514 (8527.48 per sec.)
    queries:                             2558514 (8527.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8527.4784
    time elapsed:                        300.0317s
    total number of events:              2558514

Latency (ms):
         min:                                    0.14
         avg:                                    1.87
         max:                                  195.78
         95th percentile:                        3.96
         sum:                              4797161.87

Threads fairness:
    events (avg/stddev):           159907.1250/912.96
    execution time (avg/stddev):   299.8226/0.01

sysbench 1.1.0-778c40b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 7737.80 qps: 7737.80 (r/w/o: 7737.80/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 8026.17 qps: 8026.17 (r/w/o: 8026.17/0.00/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 7983.71 qps: 7983.71 (r/w/o: 7983.71/0.00/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 8285.44 qps: 8285.44 (r/w/o: 8285.44/0.00/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 8603.05 qps: 8603.05 (r/w/o: 8603.05/0.00/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 8342.02 qps: 8342.02 (r/w/o: 8342.02/0.00/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 8223.70 qps: 8223.70 (r/w/o: 8223.70/0.00/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 8156.70 qps: 8156.70 (r/w/o: 8156.70/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 8279.66 qps: 8279.66 (r/w/o: 8279.66/0.00/0.00) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 8646.88 qps: 8646.88 (r/w/o: 8646.88/0.00/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 8684.97 qps: 8684.97 (r/w/o: 8684.97/0.00/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 8423.60 qps: 8423.60 (r/w/o: 8423.60/0.00/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 32 tps: 8458.42 qps: 8458.42 (r/w/o: 8458.42/0.00/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 8685.74 qps: 8685.74 (r/w/o: 8685.74/0.00/0.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 32 tps: 8384.80 qps: 8384.80 (r/w/o: 8384.80/0.00/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 8659.79 qps: 8659.79 (r/w/o: 8659.79/0.00/0.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 32 tps: 8412.99 qps: 8412.99 (r/w/o: 8412.99/0.00/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 7929.74 qps: 7929.74 (r/w/o: 7929.74/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 32 tps: 8299.97 qps: 8299.97 (r/w/o: 8299.97/0.00/0.00) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 7971.20 qps: 7971.20 (r/w/o: 7971.20/0.00/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 32 tps: 8853.76 qps: 8853.76 (r/w/o: 8853.76/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 9277.20 qps: 9277.20 (r/w/o: 9277.20/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 32 tps: 8204.16 qps: 8204.16 (r/w/o: 8204.16/0.00/0.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 8841.30 qps: 8841.30 (r/w/o: 8841.30/0.00/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 32 tps: 8997.45 qps: 8997.45 (r/w/o: 8997.45/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 8905.99 qps: 8905.99 (r/w/o: 8905.99/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 32 tps: 9108.38 qps: 9108.38 (r/w/o: 9108.38/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 9224.29 qps: 9224.29 (r/w/o: 9224.29/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 32 tps: 9148.58 qps: 9148.58 (r/w/o: 9148.58/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 9071.51 qps: 9071.51 (r/w/o: 9071.51/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2558431
        write:                           0
        other:                           0
        total:                           2558431
    transactions:                        2558431 (8526.45 per sec.)
    queries:                             2558431 (8526.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8526.4466
    time elapsed:                        300.0583s
    total number of events:              2558431

Latency (ms):
         min:                                    0.14
         avg:                                    3.75
         max:                                  777.62
         95th percentile:                        7.04
         sum:                              9597884.15

Threads fairness:
    events (avg/stddev):           79950.9688/428.45
    execution time (avg/stddev):   299.9339/0.01